# FBXExportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FBXExportOptions Constructor
FBXExportOptions Class See Also
---
Default constructor. Sets all options to their default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FBXExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FBXExportOptions()
```

# See Also
FBXExportOptions Class
Autodesk.Revit.DB Namespace